{
  "title": "Гайд по Extra Utilities 2",
  "author": "RWTema",
  "pages": [
    {
      "title": "Перед началом",
      "text": "Мод в стадии разработки, и будущие версии будут основаны на этой. Это значит, что некоторые блоки/предметы еще не готовы и/или будут изменены. Используйте их на свой страх и риск.\n\nПеревод на русский язык выполнен SfortzaPhantom (sfortzaphantom.carrd.co)."
    },
    {
      "title": "Энергосеть",
      "text": "Extra Utilities 2 использует свою систему энергии, основанную на следующих принципах:\n\n 1. Вам не нужно топливо: генераторы вырабатывают энергию пассивно из окружения.\n 2. Забудьте о проводах! Просто поставьте генератор энергии и устройства, использующие энергию, в любом измерении, и они автоматически подключатся к энергосети игрока.\n 3. Персональные энергосети. Каждая энергосеть уникальна для игрока. Разделить их нельзя, но два игрока могут объединить свои энергосети (в разработке). 4. Энергию хранить не выйдет: либо Вы используете ее, либо она уходит впустую.\n5. Если Вам не хватает энергии для выполнения каких-либо условий... все пропало и работать не будет."
    },
    {
      "title": "Делимся Энергией сети",
      "text": "При желании несколько человек могут обмениваться энергией своих сетей. Используйте команду /xu_powesharing, чтобы настроить список игроков, которые могут пользоваться Вашей сетью. Если они сделают то же самое, ваши энергосети будут объединены."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 7,
      "text": "Самая простая и примитивная форма генерации энергии сети (ЭС). Пока игрок крутит шестерню, будет вырабатываться ЭС. Такой метод выработки ЭС не подойдет в долгосрочной перспективе, но позволит игроку использовать резонатор, чтобы создавать компоненты для более сложных предметов."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 0,
      "text": "Солнечные панели – один из простейших генераторов ЭС: они не требуют дополнительных условий для выработки энергии, но могут работать только днем."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 1,
      "text": "Лунные панели вырабатывают ЭС только ночью и могут использоваться как дополнение к солнечным панелям."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 2,
      "text": "Вырабатывает ЭС, когда находится рядом с лавой (но не над ней)."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 3,
      "text": "Вырабатывает ЭС, когда находится рядом с текущей водой. Это важно: генератор не работает рядом с источником воды (и если находится над потоком воды)."
    },
    {
      "entry": "PassiveGenerator",
      "meta": 4,
      "text": "Вырабатывает ЭС, используя силу ветра. Количество выработанной ЭС зависит от силы ветра, которая может меняться со временем."
    },

    {
      "entry": "PassiveGenerator",
      "meta": 5,
      "text": "Этот генератор вырабатывает ЭС, если расположен над огнем."
    },

    {
      "entry": "Resonator",
      "text": "Резонатор собирает ЭС из Вашей энергосети и использует ее для создания компонентов, которые пригодятся в продвинутых устройствах."
    },
    {
      "entry": "sunCrystal",
      "text": "Обернув алмаз в светопыль, и поместив его под прямые лучи света, Вы заметили странную реакцию: кристалл начинает излучать странный «призрачный свет», который проходит даже через стены – и значительно дальше, чем обычный свет. Возможно, у Вас получится обуздать эту силу?.."
    },
    {
      "entry": "wateringCan",
      "text": "Для роста растениям нужна влага, свет и немного любви. Эта лейка предоставляет немного влаги и обильное количество по-настоящему рабочей любви. \n Скрафтите пустую лейку, затем удерживайте ПКМ на источнике воды, чтобы заполнить ее. После этого удерживайте ПКМ, чтобы полить водой область 3х3."
    },
    {
      "entry": "ItemBuildersWand",
      "text": "Когда Вы жмете ПКМ на блоке, жезл проверяет Ваш инвентарь на наличие тех же самых блоков. После этого он пытается добавить еще один слой таких же блоков (направление зависит от того, на какую сторону блока Вы нажали правой кнопкой мыши) за счет блоков из Вашего инвентаря – вплоть до 9 блоков за раз."
    },
    {
      "entry": "ItemDestructionWand",
      "text": "[в разработке]"
    },
    {
      "entry": "soundMuffler",
      "text": "Завели ферму овец, которая производит вдовесок к шерсти постоянное раздражающее блеяние животных, которое мешает Вам жить? У нас есть для Вас решение: этот блок делает любые звуки в радиусе 8 блоков на 90% тише, позволяя Вам насладиться практически полной тишиной."
    },
    {
      "entry": "enderLilly",
      "text": "Эндер-лилии – древние растения, семена которых могут быть найдены только в сокровищницах. Они растут невероятно медленно (аж целую неделю!), и когда вырастают полностью, с них можно собрать жемчуг Края. Будьте аккуратнее: шипы, вырастающие на этом цветке, колются."
    },
    {
      "entry": "trashcan",
      "text": "Если у Вас в инвентаре накопилось много ненужных вещей, это ведро – лучший способ избавиться от них."
    },
    {
      "entry": "angelBlock",
      "text": "Лучший друг игрока в режиме творчества (или игрока, который вдруг оказался далеко от дома, в океане и без блоков вокруг). Просто нажмите ПКМ по воздуху, и этот блок появится прямо перед Вами, не требуя наличия других блоков рядом."
    },
    {
      "entry": "RedstoneClock",
      "text": "Этот блок выдает сигнал красного камня каждую секунду (как настоящие часы!). Чтобы отключить, подайте сигнал красного камня на таймер."
    },
    {
      "entry": "goldenLasso",
      "text": "Надоело вести пшеницей за собой орды коров и овец? Используйте Золотое Лассо на любом мирном мобе, нажав ПКМ, чтобы волшебным образом поймать его туда. Затем нажмите ПКМ там, где Вы хотите выпустить моба. С помощью этого инструмента перетаскивать животных становится одним удовольствием. \nПроклятое Лассо – более «злая» версия Золотого Лассо, позволяющая захватывать любых мобов, которые не являются боссами. Тем не менее, для такого захвата Вам нужно оставить им очень малое количество здоровья."
    },
    {
      "entry": "compressedCobblestone",
      "text": "У Вас в доме лежат шалкеровые ящики с булыжником, и Вы хотели бы хранить их более компактно? Сложите девять единиц булыжника в верстаке, чтобы получить сжатый булыжник, затем сложите 9 единиц сжатого булыжника, чтобы получить дважды сжатый булыжник… и так вплоть до восьмикратно сжатого булыжника. Кстати, восьмикратно сжатый булыжник – это 43,0467,721 блоков обычного булыжника (удачи накопать столько)."
    },
    {
      "entry": "GlassCutter",
      "text": "Стеклорез используется для резки стекла (логично). На любом «стеклянном» материале этот инструмент работает, применяя Шелковое касание."
    },
    {
      "entry": "enderShard",
      "text": "Зачастую попытка проколоть гладкую, но хрупкую жемчужину Края приводит к ее уничтожению. Однако хорошо заточенный стеклорез способен разрезать ее на небольшие части, которые все еще будут иметь определенные свойства, присущие объектам из Края."
    },
    {
      "entry": "BagOfHolding",
      "text": "Удобный способ держать при себе много предметов. Нажмите ПКМ, чтобы открыть сумку."
    },
    {
      "entry": "RedOrchid",
      "text": "Красный камень – мощный материал, но явно не плодородный. Несмотря на это, одно растение все же смогло прижиться на руде красного камня: краснокаменная орхидея.\nВырастая полностью, эти удивительные растения перерабатывают небольшое количество каменной пыли в красную пыль, а также посылают сигнал красного камня."
    },
    {
      "entry": "angelRing",
      "text": "Позволяет летать [в разработке]."
    },
    {
      "entry": "screen",
      "text": "Показывает изображения [в разработке]."
    },
    {
      "entry": "ChunkLoader",
      "text": "Когда получает ЭС, загружает вокруг себя чанки в области 3х3."
    },
    {
      "entry": "book",
      "text": "Сейчас Вы читаете эту книгу."
    },
    {
      "entry": "Boomerang",
      "text": "Бумеранг, который всегда возвращается. Нажмите ПКМ, чтобы метнуть его: в таком случае бумеранг будет лететь вперед, пока не столкнется со стеной или сущностью. Тогда он полетит обратно (даже сквозь стены, если это нужно). На своем пути бумеранг будет собирать выпавшие предметы, опыт и притягивать их к игроку.\nВы также можете положить вместе с бумерангом оседающее зелье, чтобы накладывать его эффект на мобов при ударе. Это будет уменьшать прочность бумеранга, и когда она закончится, нужно снова будет использовать зелье в верстаке (но это, видимо, не работает в версии мода – прим. перев.). Кроме того, на бумеранг можно накладывать различные зачарования, чтобы улучшить его."
    },
    {
      "entry": "Wrench",
      "text": "Разводной ключ позволяет Вам настраивать блоки и устройства на свое усмотрение."
    },
    {
      "entry": "CursedEarth",
      "text": "Нажмите ПКМ по блоку земли/грязи с помощью «частицы зла» (редкий дроп со скелетов-иссушителей), чтобы создать проклятую землю. Во тьме эта земля будет призывать мобов независимо от того, рядом ли игрок или нет. Призванные таким образом мобы значительно сильнее своих обычных вариаций и обладают «темной аурой», но через минуту деспавнятся. Огонь – самый эффективный способ для уничтожения проклятой земли."
    },

    {
      "entry": "Scanner",
      "text": "Сканер постоянно проверяет блок перед собой на выполнение установленных условий, и если они соблюдаются – выдает сигнал красного камня."
    },
    {
      "entry": "Crafter",
      "text": "Получив рецепт крафта, этот блок будет создавать нужные предметы, используя компоненты из своего инвентаря и отправляя туда же готовые предметы. Если в инвентаре блока не окажется компонентов, он попытается достать их из соседних инвентарей. Вы можете сделать таким образом целую цепочку из механических верстаков, чтобы создавать сложные предметы."
    },
    {
      "entry": "User",
      "text": "Этот блок будет пытаться использовать предметы из своего инвентаря в мире, как будто бы их использует игрок (или выступать эквивалентом пустой руки, если предметов нет). Используя интерфейс, Вы можете задать нужное поведение этого блока."
    },
    {
      "entry": "Miner",
      "text": "Механический шахтер будет незамедлительно добывать любые блоки перед собой, собирая дроп с них в свой инвентарь. Используйте книги зачарований для кирки, чтобы контролировать действия механического шахтера."
    },
    {
      "entry": "pipe",
      "text": "Транспортные трубы – главный элемент системы передачи. Установив транспортные трубы в мире, узлы могут подключаться к ним и пересылать по ним же жидкости и предметы. Нажмите ПКМ разводным ключом по трубе, чтобы установить ей режим транспортировки в одну сторону. Если два соседних соединения настроены на односторонний режим, они не соединятся."
    },
    {
      "entry": "Grocket",
      "title": "Узлы пересылки",
      "text": "Если узел пересылки подключен к нужному блоку (например, к сундуку), он будет пытаться извлечь оттуда предметы или жидкости, после чего попытается отправить их по подключенной трубе куда-либо. Вы можете настроить фильтр, чтобы отправлять только нужные вещи, а также подключать различные улучшения – но последнее будет тратить ЭС."
    },
    {
      "entry": "Grocket",
      "title": "Узлы приема",
      "text": "Узлы приема – противоположность узлов пересылки. Они вытаскивают предметы из подключенных труб и пытаются переместить их в подключенное хранилище."
    },
    {
      "entry": "Grocket",
      "meta": 1,
      "text": "Транспортные фильтры используются, чтобы контролировать, какие жидкости/предметы могут попадать в инвентарь с использованием узлов приема. Поместите их на трубу, и все, что проходит через транспортную трубу, будет подчиняться правилам фильтрации."
    },
    {
      "entry": "Filter",
      "text": "Этот фильтр позволяет выбрать предметы, которые будут подходить под условие. Если любой предмет, помещенный в инвентарь фильтра предметов, подходит под условие, он идет дальше. Вы можете также установить фильтры предметов в фильтры предметов, чтобы у Вас были фильтры предметов внутри фильтров предметов – а также несколько комбинированных условий для сортировки Ваших ресурсов."
    },
    {
      "entry": "FilterFluids",
      "text": "Тот же фильтр, но для жидкостей. Поместите ведро с жидкостью в слот фильтра, чтобы задать необходимые предметы."
    },
    {
      "entry": "PlayerChest",
      "text": "Сундук игрока магическим образом связывается с Вашим инвентарем, позволяя удаленно передавать и вытаскивать оттуда предметы. Вам необходимо настроить сундук и выбрать слоты инвентаря, из которых можно доставать предметы или перекладывать их туда (по умолчанию все слоты закрыты). Другие игроки могут открыть Ваш инвентарь, нажав ПКМ по сундуку игрока."
    },
    {
      "entry": "Indexer",
      "text": "Если Вы подключите индексатор к своей транспортной системе, он будет сканировать трубы на наличие инвентарей и покажет все предметы, доступные для выгрузки. Нажмите ЛКМ, чтобы запросить предмет, и индексатор вытащит из инвентаря один предмет (если это возможно), после чего поместит его в свой внутренний инвентарь. Нажатие Shfit+ЛКМ позволит выгрузить целый стак предметов, но они будут выгружаться по одному. Кроме того, индексатор позволяет возвращать предметы обратно из «возвратных слотов» в самом низу интерфейса – их можно вытащить с помощью системы труб."
    },
    {
      "entry": "IndexerRemote",
      "text": "Пульт удаленного управления работает как сундук Края для индексаторов. Нажмите ПКМ по индексатору, чтобы связать его с пультом, и теперь Вы сможете открывать индексатор из любой точки мира."
    },
    {
      "entry": "Indexer",
      "title": "Интеграция индексатора с JEI",
      "text": "Если у Вас установлен Just Enough Items, Вы можете использовать строку поиска для сортировки вещей, которые Вам нужны. Кроме того, если Вы ищете рецепт крафта, нажмите ПКМ по кнопке «+», чтобы попытаться запросить все предметы, нужные для создания."
    },
    {
      "entry": "potion_second_chance",
      "text": "Если Вы получите смертельный урон, пока на Вас наложен этот эффект, Вы полностью излечитесь, эффект зелья спадет, а также на Вас будет наложен эффект слабости. Второй шанс работает единожды за жизнь – даже если Вы вновь выпьете зелье с этим эффектом. На то он и второй шанс."
    },
    {
      "entry": "potion_love",
      "text": "Бросьте взрывное зелье с этим эффектом в двух животных, чтобы они начали размножаться. Не работает на игроков."
    },
    {
      "entry": "potion_gravity",
      "text": "Зелье гравитации будет притягивать любую летающую сущность к земле. Чем сущность выше, тем быстрее она притянется к земле (даже если это игрок в режиме творчества)."
    },
    {
      "entry": "potion_fizzy_lifting",
      "text": "Это зелье будет медленно поднимать Вас ввысь."
    },
    {
      "entry": "potion_greek_fire",
      "text": "Зелье греческого огня будет заставлять любую сущность гореть. Эффект огня будет накладываться на сущность до тех пор, пока не пройдет эффект этого зелья."
    },
    {
      "entry": "potion_relapse",
      "text": "Зелье рецидива запрещает игроку излечиваться от негативных эффектов. Теперь молоко лишь уменьшит продолжительность негативных эффектов. Кстати, этот эффект не сбрасывается никаким образом."
    },

    {
      "entry": "villager_red_mechanic",
      "text": "Эти жители в красных робах уважают красный камень и поле Энергосети, веря, что оно наделяет их особыми силами. Так ли это на самом деле, никто не знает – но адепты Энергосети за определенную цену готовы с радостью поделиться реликвиями своего культа."
    },
    {
      "entry": "villager_alchemist",
      "text": "Гордые ученики искусства зельеварения используют все свои знания, чтобы создавать мощные зелья, которые затем они продают. Если же им не хватает ингредиентов, они готовы купить готовые зелья за изумруды. Забавный факт: их бороды ненастоящие и держатся на проводке."
    },
    {
      "entry": "villager_shady_merchant",
      "text": "У этих подозрительных жителей всегда есть что-нибудь интересненькое. Но лучше не спрашивать, откуда у них те или иные редкие вещи: они об этом никогда не скажут."
    }
  ]
}
